In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('loan_prediction.csv')
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [3]:
# Displaying last five rows
df.tail()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
609,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [4]:
df.shape

(614, 13)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [6]:
# Finding sum of null values
df.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [7]:
# Displaying null values in percentage
df.isnull().sum()*100/len(df)

Loan_ID              0.000000
Gender               2.117264
Married              0.488599
Dependents           2.442997
Education            0.000000
Self_Employed        5.211726
ApplicantIncome      0.000000
CoapplicantIncome    0.000000
LoanAmount           3.583062
Loan_Amount_Term     2.280130
Credit_History       8.143322
Property_Area        0.000000
Loan_Status          0.000000
dtype: float64

<h3 style="color:blue;">Drop columns where missing values is less than 5% and fill those above </h3>

In [8]:
# Drop LOAN_ID column
df = df.drop("Loan_ID", axis="columns")
df.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [9]:
columns = ["Gender", "Dependents", 'Married', 'LoanAmount', 'Loan_Amount_Term' ]

In [10]:
df = df.dropna(subset = columns)

In [11]:
# Displaying null values in percentage
df.isnull().sum()*100/len(df)

Gender               0.000000
Married              0.000000
Dependents           0.000000
Education            0.000000
Self_Employed        5.424955
ApplicantIncome      0.000000
CoapplicantIncome    0.000000
LoanAmount           0.000000
Loan_Amount_Term     0.000000
Credit_History       8.679928
Property_Area        0.000000
Loan_Status          0.000000
dtype: float64

In [12]:
# Most appearing value in the column
df["Self_Employed"].mode()[0]

'No'

In [13]:
df["Self_Employed"]= df["Self_Employed"].fillna(df["Self_Employed"].mode()[0])

In [14]:
# Displaying null values in percentage
df.isnull().sum()*100/len(df)

Gender               0.000000
Married              0.000000
Dependents           0.000000
Education            0.000000
Self_Employed        0.000000
ApplicantIncome      0.000000
CoapplicantIncome    0.000000
LoanAmount           0.000000
Loan_Amount_Term     0.000000
Credit_History       8.679928
Property_Area        0.000000
Loan_Status          0.000000
dtype: float64

In [15]:
df["Credit_History"].unique()

array([ 1.,  0., nan])

In [16]:
df["Credit_History"]= df["Credit_History"].fillna(df["Credit_History"].mode()[0])

In [17]:
# Displaying null values in percentage
df.isnull().sum()*100/len(df)

Gender               0.0
Married              0.0
Dependents           0.0
Education            0.0
Self_Employed        0.0
ApplicantIncome      0.0
CoapplicantIncome    0.0
LoanAmount           0.0
Loan_Amount_Term     0.0
Credit_History       0.0
Property_Area        0.0
Loan_Status          0.0
dtype: float64

In [18]:
df.sample(6)

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
601,Male,Yes,0,Not Graduate,No,2894,2792.0,155.0,360.0,1.0,Rural,Y
501,Female,No,0,Graduate,No,3159,0.0,100.0,360.0,1.0,Semiurban,Y
574,Male,Yes,3+,Graduate,No,6406,0.0,150.0,360.0,1.0,Semiurban,N
245,Male,No,0,Graduate,Yes,6050,4333.0,120.0,180.0,1.0,Urban,N
85,Male,No,0,Graduate,No,2366,2531.0,136.0,360.0,1.0,Semiurban,Y
295,Male,Yes,3+,Graduate,No,4416,1250.0,110.0,360.0,1.0,Urban,Y

In [19]:
df['Dependents'].unique()

array(['1', '0', '2', '3+'], dtype=object)

In [20]:
df['Dependents'] = df['Dependents'].replace(to_replace="3+", value='4')

In [21]:
df['Dependents'].unique()

array(['1', '0', '2', '4'], dtype=object)

In [22]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [23]:
df['Gender'] = df['Gender'].map({'Male':1, 'Female':0}).astype("int")

In [24]:
df['Gender'].unique()

array([1, 0])

In [25]:
df['Married'].unique()

array(['Yes', 'No'], dtype=object)

In [26]:
df['Married'] = df['Married'].map({'Yes':1, 'No':0}).astype("int")

In [27]:
df['Married'].unique()

array([1, 0])

In [28]:
df.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1,1,1,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,1,1,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,1,1,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,1,0,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
5,1,1,2,Graduate,Yes,5417,4196.0,267.0,360.0,1.0,Urban,Y

In [29]:
df['Loan_Status'].unique()

array(['N', 'Y'], dtype=object)

In [30]:
df['Education'] = df['Education'].map({'Graduate':1, 'Not Graduate':0}).astype("int")
df['Self_Employed'] = df['Self_Employed'].map({'Yes':1, 'No':0}).astype("int")
df['Property_Area'] = df['Property_Area'].map({'Rural':1, 'Urban':0, 'Semiurban':2}).astype("int")
df['Loan_Status'] = df['Loan_Status'].map({'Y':1, 'N':0}).astype("int")

In [31]:
df[:2]

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1,1,1,1,1,0,4583,1508.0,128.0,360.0,1.0,1,0
2,1,1,0,1,1,3000,0.0,66.0,360.0,1.0,0,1

In [32]:
X = df.drop("Loan_Status", axis="columns")
y = df['Loan_Status']

In [33]:
X.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
1,1,1,1,1,0,4583,1508.0,128.0,360.0,1.0,1
2,1,1,0,1,1,3000,0.0,66.0,360.0,1.0,0
3,1,1,0,0,0,2583,2358.0,120.0,360.0,1.0,0
4,1,0,0,1,0,6000,0.0,141.0,360.0,1.0,0
5,1,1,2,1,1,5417,4196.0,267.0,360.0,1.0,0

In [34]:
y.head()

1    0
2    1
3    1
4    1
5    1
Name: Loan_Status, dtype: int32

<h3 style="color:blue;">Feature Scaling</h3>

In [35]:
df.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1,1,1,1,1,0,4583,1508.0,128.0,360.0,1.0,1,0
2,1,1,0,1,1,3000,0.0,66.0,360.0,1.0,0,1
3,1,1,0,0,0,2583,2358.0,120.0,360.0,1.0,0,1
4,1,0,0,1,0,6000,0.0,141.0,360.0,1.0,0,1
5,1,1,2,1,1,5417,4196.0,267.0,360.0,1.0,0,1

In [36]:
cols = ['ApplicantIncome','CoapplicantIncome','LoanAmount','Loan_Amount_Term']

In [37]:
from sklearn.preprocessing import StandardScaler
st = StandardScaler()
X[cols] = st.fit_transform(X[cols])

In [38]:
X.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
1,1,1,1,1,0,-0.128694,-0.049699,-0.214368,0.279961,1.0,1
2,1,1,0,1,1,-0.394296,-0.545638,-0.952675,0.279961,1.0,0
3,1,1,0,0,0,-0.464262,0.229842,-0.309634,0.279961,1.0,0
4,1,0,0,1,0,0.109057,-0.545638,-0.059562,0.279961,1.0,0
5,1,1,2,1,1,0.011239,0.834309,1.440866,0.279961,1.0,0

#### Split dataset and apply K-Fold Cross Validation

In [42]:
from sklearn.model_selection import cross_val_score
from sklearn.metrics import accuracy_score
import numpy as np
from sklearn.model_selection import train_test_split

In [46]:
model_df = {}
def model_val(model,X,y):
    X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)
    model.fit(X_train, y_train)
    y_predicted=model.predict(X_test)
    print(f"{model} accuracy is {accuracy_score(y_test, y_predicted)}")
    score = cross_val_score(model,X, y, cv=5)
    print(f"{model} Average Cross Val Score is {np.mean(score)}")
    model_df[model] = round(np.mean(score)*100, 2)

### Logistic Regression

In [47]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression()
model_val(model, X, y)

LogisticRegression() accuracy is 0.8018018018018018
LogisticRegression() Average Cross Val Score is 0.8011629811629811

## Using SVC

In [48]:
from sklearn import svm
model = svm.SVC()
model_val(model, X, y)

SVC() accuracy is 0.8018018018018018
SVC() Average Cross Val Score is 0.7938902538902539

In [49]:
model_df

{LogisticRegression(): 80.12, SVC(): 79.39}

## Decision Tree Classifier

In [50]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()
model_val(model, X, y)

DecisionTreeClassifier() accuracy is 0.7297297297297297
DecisionTreeClassifier() Average Cross Val Score is 0.7215724815724815

## Random Forest Classifier

In [51]:
from sklearn.ensemble import RandomForestClassifier
model = RandomForestClassifier()
model_val(model, X, y)

RandomForestClassifier() accuracy is 0.7747747747747747
RandomForestClassifier() Average Cross Val Score is 0.7866830466830468

## Gradient Boosting Classifier

In [52]:
from sklearn.ensemble import GradientBoostingClassifier
model = GradientBoostingClassifier()
model_val(model, X, y)

GradientBoostingClassifier() accuracy is 0.7837837837837838
GradientBoostingClassifier() Average Cross Val Score is 0.7757739557739558

In [53]:
model_df

{LogisticRegression(): 80.12,
 SVC(): 79.39,
 DecisionTreeClassifier(): 72.16,
 RandomForestClassifier(): 78.67,
 GradientBoostingClassifier(): 77.58}

## Hyperparameter Tuning

In [54]:
from sklearn.model_selection import RandomizedSearchCV

### Tuning hyperparameter for Logistic Regression

In [55]:
log_reg_grid = {"C":np.logspace(-4,4,20),
               "solver":['liblinear']}

In [56]:
rs_log_reg=RandomizedSearchCV(LogisticRegression(),param_distributions=log_reg_grid,n_iter=20,cv=5,verbose=True)

In [57]:
rs_log_reg.fit(X,y)

Fitting 5 folds for each of 20 candidates, totalling 100 fits

RandomizedSearchCV(cv=5, estimator=LogisticRegression(), n_iter=20,
                   param_distributions={'C': array([1.00000000e-04, 2.63665090e-04, 6.95192796e-04, 1.83298071e-03,
       4.83293024e-03, 1.27427499e-02, 3.35981829e-02, 8.85866790e-02,
       2.33572147e-01, 6.15848211e-01, 1.62377674e+00, 4.28133240e+00,
       1.12883789e+01, 2.97635144e+01, 7.84759970e+01, 2.06913808e+02,
       5.45559478e+02, 1.43844989e+03, 3.79269019e+03, 1.00000000e+04]),
                                        'solver': ['liblinear']},
                   verbose=True)

In [59]:
rs_log_reg.best_score_

0.8084193284193285

In [60]:
rs_log_reg.best_params_

{'solver': 'liblinear', 'C': 0.23357214690901212}

### Tuning hyperparameter for SVC

In [61]:
svc_grid = {"C":[0.25,0.5,0.75,1],
           "kernel":["linear"]}

In [62]:
rs_svc=RandomizedSearchCV(svm.SVC(), param_distributions=svc_grid, cv=5, n_iter=20, verbose=True)

In [63]:
rs_svc.fit(X,y)

C:\Users\KIPRONO\anaconda3\lib\site-packages\sklearn\model_selection\_search.py:292: UserWarning: The total space of parameters 4 is smaller than n_iter=20. Running 4 iterations. For exhaustive searches, use GridSearchCV.
  warnings.warn(

Fitting 5 folds for each of 4 candidates, totalling 20 fits

RandomizedSearchCV(cv=5, estimator=SVC(), n_iter=20,
                   param_distributions={'C': [0.25, 0.5, 0.75, 1],
                                        'kernel': ['linear']},
                   verbose=True)

In [64]:
rs_svc.best_score_

0.8066011466011467

In [65]:
rs_svc.best_params_

{'kernel': 'linear', 'C': 0.25}

<h3 style="color:blue;">Saving the model</h3>

In [66]:
# Retraining the model using the best values found after hyperparameter tuning. Here we are choosing Random Foreest Classifier
X = df.drop("Loan_Status", axis="columns")
y = df['Loan_Status']

In [67]:
rf=RandomForestClassifier(n_estimators=270,min_samples_split=5, min_samples_leaf=5, max_features="sqrt", max_depth=5)

In [68]:
rf.fit(X,y)

RandomForestClassifier(max_depth=5, max_features='sqrt', min_samples_leaf=5,
                       min_samples_split=5, n_estimators=270)

In [70]:
# Saving the model
import joblib
joblib.dump(rf, "loan_prediction_model")

['loan_prediction_model']

In [71]:
model = joblib.load('loan_prediction_model')

In [73]:
df.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1,1,1,1,1,0,4583,1508.0,128.0,360.0,1.0,1,0
2,1,1,0,1,1,3000,0.0,66.0,360.0,1.0,0,1
3,1,1,0,0,0,2583,2358.0,120.0,360.0,1.0,0,1
4,1,0,0,1,0,6000,0.0,141.0,360.0,1.0,0,1
5,1,1,2,1,1,5417,4196.0,267.0,360.0,1.0,0,1

In [76]:
import pandas as pd
df_test = pd.DataFrame({
    "Gender":1,
    "Married":0,
    "Dependents":2,
    "Education":0,
    "Self_Employed":0,
    "ApplicantIncome":2889,
    "CoapplicantIncome":0.0,
    "LoanAmount":45,
    "Loan_Amount_Term":180,
    "Credit_History":0,
    "Property_Area":1
}, index=[0])

In [77]:
df_test

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,1,0,2,0,0,2889,0.0,45,180,0,1

In [79]:
result = model.predict(df_test)

In [80]:
if result ==1:
    print("Your Loan Was Approved")
else:
    print("Your Loan Was not Approved. Try Again Later")

Your Loan Was not Approved. Try Again Later